In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:WECHALE$0398_wess@localhost:3306/loan_1

Connecting to 'mysql+pymysql://root:***@localhost:3306/loan_1'

In [4]:
%%sql

SELECT Property_Area,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Property_Area

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------------+
| Property_Area | Approval_by_Property_Area |
+---------------+---------------------------+
|       2       |          21.6612          |
|       0       |          17.9153          |
|       1       |          29.1531          |
+---------------+---------------------------+

In [5]:
%%sql

SELECT Dependents,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Dependents

FROM loan_data_clean

GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+------------------------+
| Dependents | Approval_by_Dependents |
+------------+------------------------+
|    0.0     |        40.2280         |
|    1.0     |        10.7492         |
|    2.0     |        12.3779         |
|    3.0     |         5.3746         |
+------------+------------------------+

In [6]:
%%sql

SELECT Married,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Marital_Status

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+----------------------------+
| Married | Approval_by_Marital_Status |
+---------+----------------------------+
|    0    |          21.8241           |
|    1    |          46.4169           |
|    2    |           0.4886           |
+---------+----------------------------+

In [7]:
%%sql

SELECT Education,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Education

FROM loan_data_clean

GROUP BY Education;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+-----------------------+
| Education | Approval_by_Education |
+-----------+-----------------------+
|     0     |        55.3746        |
|     1     |        13.3550        |
+-----------+-----------------------+

In [8]:
%%sql

SELECT Self_Employed,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Employment_Status

FROM loan_data_clean

GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------------------------------+
| Self_Employed | Approval_by_Employment_Status |
+---------------+-------------------------------+
|       0       |            55.8632            |
|       1       |             9.1205            |
|       2       |             3.7459            |
+---------------+-------------------------------+

In [9]:
%%sql

SELECT * 

FROM loan_data_clean

WHERE LoanAmount / ApplicantIncome > (
    SELECT AVG(LoanAmount / ApplicantIncome) 
    FROM loan_data_clean WHERE ApplicantIncome > 0 AND LoanAmount > 0

);

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

80 rows affected.

+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
| MyUnknownColumn | Gender | Married | Dependents | Education | Self_Employed | ApplicantIncome | CoapplicantIncome |     LoanAmount     | Loan_Amount_Term | Credit_History | Property_Area | Loan_Status |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
|        13       |   1    |    0    |    0.0     |     0     |       0       |        24       |       2840.0      |       114.0        |      360.0       |      1.0       |       0       |      0      |
|        14       |   1    |    1    |    2.0     |     0     |       0       |        7        |       1086.0      |        17.0        |      120.0       |      1.0       |       2       |      1      |
|        28       |   1    |    0    |    0.0     |     1     |       0       |        9        |        0.0        |        35.0        |      360.0       |      1.0       |       2       |      0      |
|        35       |   1    |    1    |    0.0     |     0     |       0       |        59       |       2067.0      | 146.41216216216216 |      360.0       |      1.0       |       2       |      1      |
|        36       |   1    |    1    |    0.0     |     0     |       0       |        21       |       1330.0      |       100.0        |      360.0       |      0.0       |       2       |      0      |
|        41       |   1    |    0    |    0.0     |     0     |       0       |        17       |       1213.0      |        47.0        |      360.0       |      1.0       |       2       |      1      |
|        50       |   0    |    1    |    0.0     |     1     |       0       |        31       |       1644.0      |       100.0        |      360.0       |      1.0       |       1       |      1      |
|        56       |   1    |    1    |    0.0     |     0     |       0       |        45       |       1591.0      |        96.0        |      360.0       |      1.0       |       1       |      1      |
|        62       |   1    |    1    |    0.0     |     1     |       1       |        92       |       3449.0      |       165.0        |      180.0       |      0.0       |       0       |      0      |
|        71       |   1    |    1    |    2.0     |     1     |       1       |        26       |       1875.0      |        97.0        |      360.0       |      1.0       |       1       |      1      |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
Truncated to displaylimit of 10.

In [18]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Property_Area, COUNT(*) as Approved_by_Property_Area
FROM Approved 
GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------------+
| Property_Area | Approved_by_Property_Area |
+---------------+---------------------------+
|       2       |            133            |
|       1       |            179            |
|       0       |            110            |
+---------------+---------------------------+

In [19]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Gender, COUNT(*) as Approvals_by_Gender
FROM Approved 
GROUP BY Gender;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | Approvals_by_Gender |
+--------+---------------------+
|   1    |         339         |
|   0    |          75         |
|   2    |          8          |
+--------+---------------------+

In [20]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Married, COUNT(*) as Approval_by_Marital_Status
FROM Approved 
GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+----------------------------+
| Married | Approval_by_Marital_Status |
+---------+----------------------------+
|    0    |            134             |
|    1    |            285             |
|    2    |             3              |
+---------+----------------------------+

In [21]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Self_Employed, COUNT(*) as Approvals_by_Employment_Status
FROM Approved 
GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------------------+
| Self_Employed | Approvals_by_Employment_Status |
+---------------+--------------------------------+
|       0       |              343               |
|       1       |               56               |
|       2       |               23               |
+---------------+--------------------------------+

In [22]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Dependents, COUNT(*) as Approval_by_Number_of_Dependents
FROM Approved 
GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+----------------------------------+
| Dependents | Approval_by_Number_of_Dependents |
+------------+----------------------------------+
|    0.0     |               247                |
|    2.0     |                76                |
|    1.0     |                66                |
|    3.0     |                33                |
+------------+----------------------------------+

In [23]:
%%sql

WITH AVG_LOANS AS (
    SELECT Property_Area, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Property_Area
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Property_Area | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       2       |  142.4283850682366  |
|       0       |  152.15996052232006 |
|       1       |  145.52386614081894 |
+---------------+---------------------+

In [24]:
%%sql

WITH AVG_LOANS AS (
    SELECT Gender, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Gender
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | AVERAGE_LOAN_AMOUNT |
+--------+---------------------+
|   1    |  149.18408008418248 |
|   0    |  127.22532577220076 |
|   2    |  208.53846153846155 |
+--------+---------------------+

In [25]:
%%sql

WITH AVG_LOANS AS (
    SELECT Dependents, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Dependents
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+---------------------+
| Dependents | AVERAGE_LOAN_AMOUNT |
+------------+---------------------+
|    0.0     |  135.99821200030112 |
|    1.0     |  158.14361420243773 |
|    2.0     |  150.11125234145035 |
|    3.0     |  189.15341812400635 |
+------------+---------------------+

In [26]:
%%sql

WITH AVG_LOANS AS (
    SELECT Self_Employed, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Self_Employed
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Self_Employed | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       0       |  141.9306992363104  |
|       1       |  171.0638595912986  |
|       2       |  153.48163006756755 |
+---------------+---------------------+